app/controllers/developers_controller.rb

SELECT "developers".* FROM "developers"
---
  def index
    @developers = Developer.all