app/controllers/employers_controller.rb

  def index
    @employers = Employer.all
---
SELECT "employers".* FROM "employers"

  def show
    @employer = Employer.find(params[:id])
---
SELECT  "employers".* FROM "employers" WHERE "employers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @employer = Employer.new(employer_params)

    respond_to do |format|
      if @employer.save
---
INSERT INTO "employers" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-09-06 20:07:46.772790"], ["updated_at", "2018-09-06 20:07:46.772790"]]

  def destroy
    @employer.destroy
---
DELETE FROM "employers" WHERE "employers"."id" = $1  [["id", 6]]

    def set_employer
      @employer = Employer.find(params[:id])
---
SELECT  "employers".* FROM "employers" WHERE "employers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]