app/controllers/projects_controller.rb

  def update_status
    @currentUser = current_developer.id
    @current_project = Project.find(params[:format])
    # @aplication = Aplication.all

    if current_developer

      if Aplication.exists?(developer_id: @currentUser, project_id:  @current_project )
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_project
      @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]